[
  {
    "title": "Getting started with Mock Service Worker",
    "url": "https://blog.logrocket.com/getting-started-with-mock-service-worker/",
    "description": "In this tutorial, we’ll learn about Mock Service Worker and how we can use it to mock network requests. We’ll build a chat application that will use the mock data provided by the Mock Service Worker API.",
    "date": "2020-09-03"
  },
  {
    "title": "Functional user interfaces with Moon.js",
    "url": "https://blog.logrocket.com/functional-uis-moon-js/",
    "description": "In this tutorial, we’ll introduce Moon.js by understanding what it is and why it was created.",
    "date": "2020-07-22"
  },
  {
    "title": "JSX-driven components with Crank.js",
    "url": "https://blog.logrocket.com/jsx-driven-components-crank-js/",
    "description": "In this tutorial, you'll learn about Crank.js by building a blogging application, which will use the JSONPlaceholder API.",
    "date": "2020-06-05"
  },
  {
    "title": "Optimizing static pages in your Next.js apps with Prisma",
    "url": "https://blog.logrocket.com/optimizing-static-pages-next-js-prisma/",
    "description": "In this article, you'll learn about next-gen SSG support and why integrating your Next.js app with Prisma makes this feature even more powerful.",
    "date": "2020-05-27"
  },
  {
    "title": "Building a table component with Tailwind CSS",
    "url": "https://blog.logrocket.com/building-a-table-component-with-tailwind-css/",
    "description": "In this tutorial, you'll learn how easy it is to build components using Tailwind CSS. Learn how to create a table component and then use Tailwind to design a better variant of it.",
    "date": "2020-04-13"
  },
  {
    "title": "Next.js, Storybook, and Lerna: Build a Monorepo Structure",
    "url": "https://buttercms.com/blog/nextjs-storybook-and-lerna-build-a-monorepo-structure",
    "description": "In this tutorial, you'll learn about how to build a monorepo using Lerna. We’ll be building a Next.js application which will import components from a separate package. We’ll also be using Storybook to showcase those components.",
    "date": "2020-03-24"
  },
  {
    "title": "Building a Product Hunt clone app using Hasura and Next.js",
    "url": "https://blog.logrocket.com/building-a-product-hunt-clone-app-using-hasura-and-next-js",
    "description": "This tutorial will demonstrate how to create a clone of product curation app Product Hunt using Hasura and Next.js. We’ll show you how to conduct authentication and authorization using Hasura and how to leverage GraphQL to fetch and write data from a Next.js frontend application.",
    "date": "2020-02-20"
  },
  {
    "title": "Understand and implement your own Redux",
    "url": "https://buttercms.com/blog/understand-and-implement-your-own-redux",
    "description": "In this tutorial, we'll discover the basic concepts of Redux and learn about Actions, Reducers, and a Store in Redux. In addition, we’ll also build our own version of Redux using vanilla JavaScript and use it in an application.",
    "date": "2019-12-29"
  },
  {
    "title": "Building a JAMstack Blog: Gatsby and ButterCMS on Netlify",
    "url": "https://buttercms.com/blog/building-a-jamstack-blog-gatsby-and-buttercms-on-netlify",
    "description": "Tutorial for building a lightning fast, static blog application hosted with Netlify using Gatsby on the front-end and ButterCMS to serve up the content.",
    "date": "2019-08-15"
  },
  {
    "title": "Building reusable components using React",
    "url": "https://buttercms.com/blog/building-reusable-components-using-react",
    "description": "React is one of the most popular JavaScript libraries for building user interfaces. To build an application using React, you just need to build encapsulated components that can contain their own state.",
    "date": "2019-06-26"
  },
  {
    "title": "How to test Next.js apps",
    "url": "https://buttercms.com/blog/how-to-test-nextjs-apps",
    "description": "In this tutorial, we’ll be using Cypress to write End to End tests for the app that was built as a part of How to Build a CMS-powered Marketing Website while Avoiding WordPress. ",
    "date": "2019-06-05"
  },
  {
    "title": "How to Build a CMS-powered Marketing Website while Avoiding WordPress",
    "url": "https://buttercms.com/blog/build-a-cms-powered-marketing-site-while-avoiding-wordpress",
    "description": "While WordPress powers 33% of the web, there are plenty of easier ways through which you can create your marketing site. WordPress can give you a basic outlook to your site.",
    "date": "2019-04-05"
  },
  {
    "title": "How to write a simple React search plugin, publish it to npm, and deploy it to Github pages",
    "url": "https://medium.freecodecamp.org/how-to-write-a-simple-react-search-plugin-publish-it-to-npm-and-deploy-it-to-github-pages-d8876dff7780",
    "description": "In this article, we’re going to write a simple search plugin in React. Through this article, I hope to help fellow developers understand how to write plugins using React, publish them to npm and deploy a demo to Github pages.",
    "date": "2019-01-16"
  },
  {
    "title": "9 steps for dockerizing a Rails api-only application",
    "url": "https://medium.com/@nirmalyaghosh/9-steps-for-dockerizing-a-rails-api-only-application-d65a8836f3df",
    "description": "Docker is a program that helps us in containerizing the environment in which development in being done. It helps us in creating a virtualized environment in which we can development applications without interfering with the host machine.",
    "date": "2018-12-25"
  },
  {
    "title": "How to write highly readable React code — 10 coding style tips",
    "url": "https://medium.freecodecamp.org/10-points-to-remember-thatll-help-you-master-coding-in-reactjs-library-d0520d8c73d8",
    "description": "This article will help you understand how you can write better code, so that other developers can better understand it. This article will give you a quick introduction to certain techniques I use while designing my components, and show you how you can do the same.",
    "date": "2018-01-03"
  },
  {
    "title": "How to Authenticate your Elixir/Phoenix APIs using Guardian",
    "url": "https://medium.freecodecamp.org/authentication-using-elixir-phoenix-f9c162b2c398",
    "description": "Authentication is always a tricky subject. People tend to use so many types of authentication in their apps. Authentication using an email address and a password with an option confirm password field is the most common. ",
    "date": "2017-03-20"
  },
  {
    "title": "Bootstrapping an API-only backend for a Social Networking app using Elixir/Phoenix",
    "url": "https://medium.com/@nirmalyaghosh/bootstrapping-an-api-only-backend-for-a-social-networking-app-using-elixir-f74a73b1da51",
    "description": "While learning any programming language, I tend to document my struggles, about how I overcome stuffs and solve problems. Recently, I started learning Elixir mostly because I wanted to explore its ‘realtime’ feature.",
    "date": "2017-03-01"
  }
]
